УправлениеПаркомАттракционов/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПосещениеАттракциона</name>
  </enumValues>
</mdclass:Enum>

УправлениеПаркомАттракционов/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов(Объект.ВидНоменклатуры, Элементы);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)

	УстановитьВидимостьЭлементов(Объект.ВидНоменклатуры, Элементы);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Установить видимость элементов.
// 
// Параметры:
//  ВидНоменклатуры - ПеречислениеСсылка.ВидНоменклатуры - Вид номенклатуры
//  Элементы - ВсеЭлементыФормы - Элементы
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Знач ВидНоменклатуры, Элементы)

	ЭтоПосещениеАттракциона = ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидНоменклатуры.ПосещениеАттракциона");
	
	Элементы.ВидАттракциона.Видимость = ЭтоПосещениеАттракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАттракциона;
	
КонецПроцедуры

#КонецОбласти
